
#Область ПрограммныйИнтерфейс

#Область УстановкаНастроек

// Инициализирует объект логирования с указанными настройками.
// Параметры
//     ИмяСобытия         - Строка - имя события/лога.
Процедура Инициализировать(ИмяСобытия="Логирование")
	
	//TODO (Цымбал): возможность настройки уровня логирования.
	//TODO (Цымбал): возможность отключения логирования.
	//TODO (Цымбал): возможность установки шаблона лога.
	//TODO (Цымбал): поля шаблона лога.
	//TODO (Цымбал): возможность установки формата даты для лога.
	//TODO (Цымбал): реализовать возможность привязывать лог в ЖР к метаданным и объекту.	
	
	ЭтотОбъект.Событие = ИмяСобытия;
	ЭтотОбъект.СпособыЛогирования.Очистить();
	
КонецПроцедуры

// Устанавливает имя события/лога и возвращает объект обработки.
Функция ПолучитьЛог(ИмяСобытия) Экспорт
	Инициализировать(ИмяСобытия);
	Возврат ЭтотОбъект;
КонецФункции

// Устанавливает событие логирования.
Процедура УстановитьСобытие(ИмяСобытия) Экспорт
	ЭтотОбъект.Событие = ИмяСобытия;
КонецПроцедуры

// Формирует структуру с описанием способа логирования
// Параметры
//     СпособЛогирования  - Строка - название способа вывода: ЖурналРегистрации, Консоль, Файл.
//     УровеньЛогирования - Строка - пока не используется.
//     ШаблонСообщения    - Строка - строка шаблона сообщения. Допустимые ключевые слова:
//       * %ДАТА%      - дата сообщения в формате указанном в ФорматДаты.
//       * %СООБЩЕНИЕ% - текст выводимого сообщения
//       * %УРОВЕНЬ%   - название уровня сообщения: ИНФОРМАЦИЯ, ОШИБКА и т.д..
//     ФорматДаты         - Строка - строка с форматом даты в сообщении лога.
//     ПутьКФайлуЛогов    - Строка - пока не используется.
// 
// Возвращаемое значение:
//     Структура - структура с описанием способа логирования, в которой есть следующие поля:
//       * Имя             - Строка - имя способа логирования: ЖурналРегистрации, Консоль, Файл.
//       * Уровень         - Строка - имя уровня логирования.
//       * ШаблонСообщения - Строка - строка с описание шаблона сообщения лога.
//       * ФорматДаты      - Строка - строка с форматом даты используемой в шаблоне сообщения (%ДАТА%).
//       * ИмяФайла        - Строка - имя файла лога, задается только для логирования в файл.
Функция ПолучитьОписаниеСпособаЛогирования(Знач СпособЛогирования, 
										   Знач УровеньЛогирования=Неопределено, 
										   Знач ШаблонСообщения="%СООБЩЕНИЕ%", 
										   Знач ФорматДаты="ДФ='yyyy-MM-dd HH:mm:ss'", 
										   Знач ПутьКФайлуЛогов="") Экспорт
										   
	Описание = Новый Структура;
	Описание.Вставить("ИмяСпособа",      СпособЛогирования); 
	Описание.Вставить("Уровень",         УровеньЛогирования);
	Описание.Вставить("ШаблонСообщения", ШаблонСообщения); 
	Описание.Вставить("ФорматДаты",      ФорматДаты);
	Описание.Вставить("ИмяФайла",        ПутьКФайлуЛогов);
										   
	Возврат Описание;
	
КонецФункции

Процедура ДобавитьСпособЛогированияЖурналРегистрации(Знач ШаблонСообщения="", Знач ФорматДаты="") Экспорт
	
	ШаблонСообщения = ?(ЗначениеЗаполнено(ШаблонСообщения), ШаблонСообщения, ШаблонПоУмолчаниюЖурналРегистрации());
	ФорматДаты      = ?(ЗначениеЗаполнено(ФорматДаты), ФорматДаты, ФорматДатыПоУмолчанию());
	
	// Проверить наличие способа логирования.
	СпособЛогирования = ЭтотОбъект.СпособыЛогирования.Найти("ЖурналРегистрации", "ИмяСпособа");
	Если СпособЛогирования <> Неопределено Тогда
		СпособЛогирования.ШаблонСообщения = ШаблонСообщения;
		СпособЛогирования.ФорматДаты      = ФорматДаты;
		Возврат;
	КонецЕсли;
	
	
	// Добавление способа логирования.
	ОписаниеСпособаЛогирования = ПолучитьОписаниеСпособаЛогирования("ЖурналРегистрации", , ШаблонСообщения, ФорматДаты);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект.СпособыЛогирования.Добавить(), ОписаниеСпособаЛогирования);
	
КонецПроцедуры

Процедура ДобавитьСпособЛогированияКонсоль(Знач ШаблонСообщения="", Знач ФорматДаты="") Экспорт
	
	ШаблонСообщения = ?(ЗначениеЗаполнено(ШаблонСообщения), ШаблонСообщения, ШаблонПоУмолчаниюКонсоль());
	ФорматДаты      = ?(ЗначениеЗаполнено(ФорматДаты), ФорматДаты, ФорматДатыПоУмолчанию());
	
	// Проверить наличие способа логирования.
	СпособЛогирования = ЭтотОбъект.СпособыЛогирования.Найти("Консоль", "ИмяСпособа");
	Если СпособЛогирования <> Неопределено Тогда
		СпособЛогирования.ШаблонСообщения = ШаблонСообщения;
		СпособЛогирования.ФорматДаты      = ФорматДаты;
		Возврат;
	КонецЕсли;
	
	// Добавление способа логирования.
	ОписаниеСпособаЛогирования = ПолучитьОписаниеСпособаЛогирования("Консоль", , ШаблонСообщения, ФорматДаты);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект.СпособыЛогирования.Добавить(), ОписаниеСпособаЛогирования);
	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеМетоды

Процедура Отладка(Знач Сообщение) Экспорт
	
	ПроверитьНастройки();
	
	Для Каждого СпособЛогирования ИЗ СпособыЛогирования Цикл
		
		Если ВРег(СпособЛогирования.ИмяСпособа) = ВРег("Консоль") Тогда
			ОтладкаКонсоль(Сообщение, СпособЛогирования);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Информация(Знач Сообщение) Экспорт
	
	Если Ложь Тогда
		
	Иначе
		ВызватьИсключение СтрШаблон("Установлен неизвестный способ логирования: %1", ЭтотОбъект.СпособыЛогирования);
	КонецЕсли;
	
КонецПроцедуры

Процедура Инфо(Знач Сообщение)  Экспорт
	ЭтотОбъект.Информация(Сообщение);
КонецПроцедуры

Процедура Предупреждение_(Знач Сообщение) Экспорт
	
КонецПроцедуры

Процедура Предупредить(Знач Сообщение) Экспорт
	Предупреждение_(Сообщение);
КонецПроцедуры

Процедура Ошибка(Знач Сообщение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗаписьВЖурналРегистрации

Процедура ОтладкаЖурналРегистрации(Знач Сообщение)
	ЗаписатьВЖурналРегистрации(Сообщение, УровеньЖурналаРегистрации.Информация);
КонецПроцедуры

Процедура ИнформацияЖурналРегистрации(Знач Сообщение)
	ЗаписатьВЖурналРегистрации(Сообщение, УровеньЖурналаРегистрации.Информация);
КонецПроцедуры

Процедура ПредупреждениеЖурналРегистрации(Знач Сообщение)
	ЗаписатьВЖурналРегистрации(Сообщение, УровеньЖурналаРегистрации.Предупреждение);
КонецПроцедуры

Процедура ОшибкаЖурналРегистрации(Знач Сообщение)
	ЗаписатьВЖурналРегистрации(Сообщение, УровеньЖурналаРегистрации.Ошибка);
КонецПроцедуры

Процедура ЗаписатьВЖурналРегистрации(Знач Сообщение, Знач УровеньЖР=Неопределено)
	
	УровеньЖР = ?(УровеньЖР = Неопределено, УровеньЖурналаРегистрации.Информация, УровеньЖР);
	
	ЗаписьЖурналаРегистрации(ЭтотОбъект.Событие, УровеньЖР, , , Сообщение);
	
	//Если ЗначениеЗаполнено(ОбъектМетаданныхЖР) Тогда
	//	ЗаписьЖурналаРегистрации(ЭтотОбъект.Событие, УровеньЖР, ОбъектМетаданныхЖР, ДанныеЖР, Сообщение);
	//Иначе
	//	
	//КонецЕсли;
	
КонецПроцедуры

Функция ШаблонПоУмолчаниюЖурналРегистрации() 
	Возврат "%СООБЩЕНИЕ%";
КонецФункции

#КонецОбласти

#Область ЗаписьВКонсоль

Процедура ОтладкаКонсоль(Знач Сообщение, ОписаниеСпособаЛогирования)
	
	ДатаСообщения   = ТекущаяДата();
	СтрокаСообщения = ОписаниеСпособаЛогирования.ШаблонСообщения;
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%ДАТА%", Формат(ДатаСообщения, ОписаниеСпособаЛогирования.ФорматДаты));
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%УРОВЕНЬ%", "ОТЛАДКА");
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%СООБЩЕНИЕ%", Сообщение);
	
	Сообщить(СтрокаСообщения, СтатусСообщения.БезСтатуса);
	
	
КонецПроцедуры

Функция ШаблонПоУмолчаниюКонсоль()
	Возврат "%ДАТА% - %УРОВЕНЬ% - %СООБЩЕНИЕ%";
КонецФункции

#КонецОбласти

#Область ЗаписьВФайл



#КонецОбласти

#Область ЗаписьВРегистр

#КонецОбласти

#Область СлужебныеФункцииИПроцедуры

Функция Инициализирован()
	Возврат Инициализирован;
КонецФункции

Функция СформироватьСообщениеПоШаблону(Знач Сообщение, Знач Уровень, Знач ДатаСообщения) 
	
	
	
	
КонецФункции

Функция ШаблонСообщенияПоУмолчанию()
	Возврат "%ДАТА% - %УРОВЕНЬ% - %СООБЩЕНИЕ%";
КонецФункции

Функция ФорматДатыПоУмолчанию()
	Возврат "ДФ='yyyy.MM.dd HH:mm:ss'";
КонецФункции

// Проверяет корректность настроек логирования и генерирует исключение, если найдена ошибка.
Процедура ПроверитьНастройки()
	
	Если ЭтотОбъект.СпособыЛогирования.Количество() = 0 Тогда
		ВызватьИсключение "Не заданы способы логирования";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти