
#Область ПрограммныйИнтерфейс

#Область УстановкаНастроек

// Инициализирует объект логирования с указанными настройками.
// Параметры
//     Параметр1 - ТипВид - описание параметра
//     Параметр1 - ТипВид - описание параметра
//     Параметр1 - ТипВид - описание параметра
//     Параметр1 - ТипВид - описание параметра
//     СпособЛогирования - Строка - название способа логирования: ЖурналРегистрации или ЖР, Файл, Консоль.
Функция Инициализировать(Событие="Логирование", СпособЛогирования="ЖР", УровеньЛогирования="", ШаблонСообщения, ФорматДаты="")
	
	ЭтотОбъект.Событие            = Событие;
	ЭтотОбъект.СпособЛогирования  = СпособЛогирования;
	ЭтотОбъект.УровеньЛогирования = УровеньЛогирования;
	ЭтотОбъект.ФорматДаты         = ФорматДаты;
	ЭтотОбъект.Инициализирован    = Истина;
	ЭтотОбъект.ДанныеЖР           = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ФорматДаты) Тогда
		ЭтотОбъект.ФорматДаты = ФорматДатыПоУмолчанию();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ШаблонСообщения) Тогда
		ЭтотОбъект.ШаблонСообщения = ШаблонСообщенияПоУмолчанию();
	КонецЕсли;
	
КонецФункции

Процедура УстановитьСобытие(СобытиеЛогирования) Экспорт
	ЭтотОбъект.Событие = СобытиеЛогирования;
КонецПроцедуры

#КонецОбласти

Процедура Информация(Знач Сообщение) Экспорт
	
	Если ВключеноЛогированиеВЖурналРегистрации() Тогда
		 ЗаписатьВЖурналРегистрации(Сообщение, УровеньЖурналаРегистрации.Информация);
	Иначе
		ВызватьИсключение СтрШаблон("Установлен неизвестный способ логирования: %1", ЭтотОбъект.СпособЛогирования);
	КонецЕсли;
	
КонецПроцедуры

Процедура Инфо(Сообщение)  Экспорт
	ЭтотОбъект.Информация(Сообщение);
КонецПроцедуры

Процедура Ошибка() Экспорт
	
КонецПроцедуры

Процедура Предупреждение_(Сообщение) Экспорт
	
КонецПроцедуры

Процедура Предупредить(Сообщение) Экспорт
	Предупреждение_(Сообщение);
КонецПроцедуры

Процедура Отладка(Сообщение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьВЖурналРегистрации

Функция ВключеноЛогированиеВЖурналРегистрации() 
	Возврат ВРег(ЭтотОбъект.СпособЛогирования) = "ЖР" 
				ИЛИ ВРег(ЭтотОбъект.СпособЛогирования) = ВРег("ЖурналРегистрации");
КонецФункции

Процедура ЗаписатьВЖурналРегистрации(Знач Сообщение, Знач УровеньЖР=Неопределено)
	
	УровеньЖР = ?(УровеньЖР = Неопределено, УровеньЖурналаРегистрации.Информация, УровеньЖР);
	
	Если ЗначениеЗаполнено(ОбъектМетаданныхЖР) Тогда
		ЗаписьЖурналаРегистрации(ЭтотОбъект.Событие, УровеньЖР, ОбъектМетаданныхЖР, ДанныеЖР, Сообщение);
	Иначе
		ЗаписьЖурналаРегистрации(ЭтотОбъект.Событие, УровеньЖР, , ДанныеЖР, Сообщение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьВФайл



#КонецОбласти

#Область ЗаписьВРегистр

#КонецОбласти

#Область СлужебныеФункцииИПроцедуры

Функция Инициализирован()
	Возврат Инициализирован;
КонецФункции

Функция СформироватьСообщениеПоШаблону(Знач Сообщение, Знач Уровень, Знач ДатаСообщения) 
	
	
	
	
КонецФункции

Функция ШаблонСообщенияПоУмолчанию()
	Возврат "%ДАТА% - %УРОВЕНЬ% - %СООБЩЕНИЕ%";
КонецФункции

Функция ФорматДатыПоУмолчанию()
	Возврат "ДФ='dd.MM.yyyy HH:mm:ss'";
КонецФункции


#КонецОбласти